{
   "ក្រសួងយុត្តិធម៌": {
      "ថ្នាក់កណ្តាល": {
         "ទីស្តីការក្រសួងយុត្តិធម៌": {},
         "ខុទ្ទកាល័យរដ្ឋមន្រ្តីក្រសួងយុត្តិធម៌": {},
         "អគ្គលេខាធិការដ្ឋាន": {
            "នាយកដ្ឋានកិច្ចការរដ្ឋបាល": [],
            "នាយកដ្ឋានកិច្ចការហិរញ្ញវត្ថុ": [],
            "នាយកដ្ឋានកិច្ចការបុគ្គលិក": [],
            "នាយកដ្ឋានបូកសរុប​ បណ្ណាសា និងព័ត៌មានវិទ្យា": []
         },
         "អគ្គនាយកដ្ឋានកិច្ចការរដ្ឋបាលតុលាការ": {
            "នាយកដ្ឋានកិច្ចការរដ្ឋបាលនៃសាលាជម្រះក្ដី": [],
            "នាយកដ្ឋានកិច្ចការហិរញ្ញវត្ថុនៃសាលាជម្រះក្ដី": [],
            "នាយកដ្ឋានកិច្ចការបុគ្គលិកនៃសាលាជម្រះក្ដី": [],
            "នាយកដ្ឋានស្រាវជ្រាវ ផ្សព្វផ្សាយ និងបណ្តុះបណ្ដាលលើវិស័យរដ្ឋបាលតុលាការ": []
         },
         "អគ្គនាយកដ្ធានកិច្ចការអយ្យការនិងព្រហ្មទណ្ឌ": {
            "នាយកដ្ឋានកិច្ចការអយ្យការ និង កិច្ចការអនុវត្តទោស": [],
            "នាយកដ្ឋានកិច្ចការព្រហ្មទណ្ឌ និងយុត្តិធម៌អនិតិជន": [],
            "នាយកដ្ឋានកិច្ចការថ្កោលទោស": [],
            "នាយកដ្ឋានជុំនួយទៅវិញទៅមកក្នុងវិស័យព្រហ្មទណ្ធ និងបត្យាប័ន": [],
            "នាយកដ្ឋានកិច្ចការច្បាប់ និងស្ថិតិព្រហ្មទណ្ឌ": [],
            "នាយកដ្ឋានស្រាវជ្រាវ ផ្សព្វផ្សាយ និងបណ្តុះបណ្តាលច្បាប់ក្នុងវិស័យព្រហ្មទណ្ឌ": []
         },
         "អគ្គនាយកដ្ធានកិច្ចការរដ្ធប្បវេណី": {
            "នាយកដ្ឋានកិច្ចការច្បាប់ និងស្ថិតិរដ្ធប្បវេណី": [],
            "នាយកដ្ឋានកិច្ចការចុះបញ្ជី និងតម្កល់": [],
            "នាយកដ្ឋានសន្ធានកម្ម និងយុត្តិធម៌": [],
            "នាយកដ្ឋានជុំនួយទៅវិញទៅមកក្នុងវិស័យរដ្ធប្បវេណី": [],
            "នាយកដ្ឋានស្រាវជ្រាវ ផ្សព្វផ្សាយ និងបណ្តុះបណ្តាលច្បាប់ក្នុងវិស័យរដ្ធប្បវេណី": []
         },
         "អគ្គនាយកដ្ធានអភិវឌ្ឈន៏វិស័យយុត្តិធម៌": {
            "នាយកទំនាក់់ទំនងអន្តរជាតី និងដៃគូអភិវឌ្ឈន៏": [],
            "នាយកសាកោរី": [],
            "នាយកអាជ្ញាសាលា": [],
            "នាយកក្រឡាបញ្ជី": [],
            "នាយកអភិបាលបណ្តោះអាសន្ន អ្នកបកប្រែ និងអ្នកជំនាញ": [],
            "នាយកស្រាវជ្រាវ និងផែនការ": []
         },
         "អគ្គនាយកដ្ធានកិច្ចការតុលាការ": {
            "នាយកលេខាធិការដ្ធាន": []
         },
         "នាយកដ្ឋានសវនកម្មផ្ទៃក្នុង": {},
         "រាជបណ្ឌិតសភាវិជ្ជាជីវៈតុលាការ": {},
         "អគ្គលេខាធិការដ្ឋាននៃឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម": {},
         "ក្រុមប្រឹក្សានីតិកម្ម និងយុត្តិធម៌": {}
      },
      "ថ្នាក់ក្រោមជាតិ": {
         "អគ្គលេខាធិការដ្ឋាន": {
            "នាយកដ្ឋានកិច្ចការរដ្ឋបាល": [],
            "នាយកដ្ឋានកិច្ចការហិរញ្ញវត្ថុ": [],
            "នាយកដ្ឋានកិច្ចការបុគ្គលិក": [],
            "នាយកដ្ឋានបូកសរុប​ បណ្ណាសា និងព័ត៌មានវិទ្យា": []
         }
      }
   }
}
